{
    "questions" : {
        "question": "A kép, amiről másolsz, Public Domain (PD, vagy CC0) licensz alatt van?",
        "yep": {
            "question": "A public domainben lévő képek szabadon felhasználhatók bármilyen célra. Bár nem kötelező, illik jelezni a kép eredeti alkotóját.",
            "status": "success"
        },
        "nope": {
            "question": "A kép, amiről másolsz, Creative Commons (CC) licensz alatt van?",
            "yep": {
                "question": "Szerepel a licenszben az ND (no derivatives)?",
                "yep": {
                    "question": "A szerző nem engedélyezi a képe átdoglozását, keress másik képet",
                    "status": "failed"
                },
                "nope": {
                    "question": "Szerepel a licenszben az NC (no commercial)?",
                    "yep": {
                        "question": "Másolhatod, illetve átdolgozhatod a művet, de nem használhatod kereskedelmi célokra, és természetesen meg kell nevezned a mű eredeti alkotóját is. (Ha a licenszben szerepel az SA (share alike), akkor csak ugyanilyen licensz alatt teheted közzé a saját művedet is.)",
                        "status": "success"
                    },
                    "nope": {
                        "question": "Másolhatod, illetve átdolgozhatod a művet, de meg kell nevezned a mű eredeti alkotóját is.  (Ha a licenszben szerepel az SA (share alike), akkor csak ugyanilyen licensz alatt teheted közzé a saját művedet is.)",
                        "status": "success"
                    }
                }
            },
            "nope": {
                "question": "A kép eredeti alkotója engedélyezte a képe felhasználását? (Jelezte egyértelműen, hogy szabadon felhasználható a műve? Megkerested emailben?)",
                "yep": {
                    "question": "Ha rendelkezel az alkotó engedélyével, természetesen lerajzolhatod a képet, de illik ilyenkor is linkelni az eredeti képet.",
                    "status": "success"
                },
                "nope": {
                    "question": "A kép szerzője több, mint 70 évvel ezelőtt meghalt?",
                    "yep": {
                        "question": "A szerző halála után 70 évvel a művei szabad felhasználásúvá válnak, így te is szabadon felhasználhatod őket. Az eredeti alkotót mindenesetre illik megnevezni.",
                        "status": "success"
                    },
                    "nope": {
                        "question": "100%-ig teljesen holtbizos, hogy nem használod fel sehol a képről készült rajzodat? (pl, kiállítás, eladás, elcserélés egy csokira, stb)",
                        "yep": {
                            "question": "A szerzői jogi törvény lehetőséget biztosít neked, hogy személyes használatra lemásold a képet, de csak és kizárólag akkor, ha ez sem közvetlenül, sem közvetve nem szolgál anyagi érdekeket.",
                            "status": "allowed"
                        },
                        "nope": {
                            "question": "Keress másik képet!",
                            "status": "failed"
                        }
                    }
                }
            }
        }
    }
}